package homework32;

/*
Написать программу, которая посчитает от 1 до 10.
В конце выведет "Это всё!"
Пример вывода:
    1
    2
    3
    4
    5
    6
    7
    8
    9
    10
    Это всё!
 */
public class Main01 {

  public static void main(String[] args) {
    for (int i = 1; i <= 10; i++) {
      System.out.println(i + " ");
    }
    System.out.println("That is all!");
  }
}

